DataProcessors/ИмпортРейтингов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ИмпортРейтингов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиПротоколаОбИзмененияхРейтингов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
					<Comment>Служебное поле, не использовать для работы</Comment>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ИмпортРейтингов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьДатуНачалаВеденияУчетаНаСервере()
	
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьДатуНачалаВеденияУчета();
	
КонецФункции // ПолучитьДатуНачалаВеденияУчетаНаСервере

&НаСервере
Процедура ВывестиПротоколНаСервере(Знач КомандаИмя, СтрокиПротокола, МакетОтчета)
	
	ЭтаФорма.Протокол.Очистить();
	
	Если КомандаИмя = "КомандаИмпортировать" Тогда
		Операция = "импорт";
		ОперацияРодП = "импорте";
	ИначеЕсли КомандаИмя = "КомандаНайтиРасхождения" Тогда
		Операция = "сверка";
		ОперацияРодП = "сверке";
	Иначе
		Возврат;
	КонецЕсли;
		
	// шапка
	ОбластьШапка = МакетОтчета.ПолучитьОбласть("ШапкаОтчета");
	ОбластьШапка.Параметры.ОперацияРодП  = ОперацияРодП + " рейтингов";
	ОбластьШапка.Параметры.Отбор         = ?(ЭтаФорма.ОтборПоСубъектуРейтинга, Объект.Субъект, "не установлен");
	
	ЭтаФорма.Протокол.Вывести(ОбластьШапка);
	
	ЭтаФорма.Протокол.Вывести(МакетОтчета.ПолучитьОбласть("ШапкаТаблицы|Рейтинг"));
	ЭтаФорма.Протокол.Присоединить(МакетОтчета.ПолучитьОбласть("ШапкаТаблицы|" + Операция));
	
	// табличная часть
	ОбластьСтрокаКол1 = МакетОтчета.ПолучитьОбласть("Строка|Рейтинг");
	ОбластьСтрокаКол2 = МакетОтчета.ПолучитьОбласть("Строка|" + Операция);
	
	Для Каждого СтрокаПротокола Из СтрокиПротокола Цикл
		ОбластьСтрокаКол1.Параметры.Заполнить(СтрокаПротокола);
		ОбластьСтрокаКол2.Параметры.Заполнить(СтрокаПротокола);
		
		ЭтаФорма.Протокол.Вывести(ОбластьСтрокаКол1);
		ЭтаФорма.Протокол.Присоединить(ОбластьСтрокаКол2);
	КонецЦикла;
	
КонецПроцедуры // ВывестиПротоколНаСервере

&НаСервере
Процедура ВыполнитьКомандуНаСервере(КомандаИмя)
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Если Не (КомандаИмя = "КомандаНайтиРасхождения" Или КомандаИмя = "КомандаИмпортировать") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В обработке импорта рейтингов не прописаны действия для команды [" + КомандаИмя + "].");
		Возврат;
	КонецЕсли;
	
	СтрокиПротокола = ОбъектНаСервере.ВыполнитьКоманду(КомандаИмя);
	ВывестиПротоколНаСервере(КомандаИмя, СтрокиПротокола, ОбъектНаСервере.ПолучитьМакет("Протоколы"));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаНачалаУчета = ПолучитьДатуНачалаВеденияУчетаНаСервере();
	
	ЭтаФорма.ОтборПоСубъектуРейтинга                = ЗначениеЗаполнено(Объект.Субъект);
	ЭтаФорма.РассылатьПротоколОбИзмененныхРейтингах = Не ПустаяСтрока(Объект.ПолучателиПротоколаОбИзмененияхРейтингов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтборПоСубъектуРейтингаПриИзменении(Неопределено);
	РассылатьПротоколОбИзмененныхРейтингахПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСубъектуРейтингаПриИзменении(Элемент)
	
	Элементы.СубъектРейтинга.Видимость = ЭтаФорма.ОтборПоСубъектуРейтинга;
	
	Если Не ЭтаФорма.ОтборПоСубъектуРейтинга Тогда
		Объект.Субъект = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассылатьПротоколОбИзмененныхРейтингахПриИзменении(Элемент)
	
	Элементы.ПолучателиПротоколаОбИзмененияхРейтингов.Видимость = ЭтаФорма.РассылатьПротоколОбИзмененныхРейтингах;
	
	Если Не ЭтаФорма.РассылатьПротоколОбИзмененныхРейтингах Тогда
		Объект.ПолучателиПротоколаОбИзмененияхРейтингов = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайтиРасхождения(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаНайтиРасхождения");
	Попытка
		ВыполнитьКомандуНаСервере(Команда.Имя);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаИмпортировать");
	Попытка
		ВыполнитьКомандуНаСервере(Команда.Имя);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
